7767517
95 105
Input                    input_1                  0 1 input_1
Convolution              functional_1/Conv1/Conv2D 1 1 input_1 functional_1/Conv1_relu/Relu6:0 0=32 1=3 3=2 15=1 16=1 5=1 6=864 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     functional_1/expanded_conv_depthwise/depthwise 1 1 functional_1/Conv1_relu/Relu6:0 functional_1/expanded_conv_depthwise_relu/Relu6:0 0=32 1=3 4=1 5=1 6=288 7=32 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              functional_1/expanded_conv_project/Conv2D 1 1 functional_1/expanded_conv_depthwise_relu/Relu6:0 functional_1/expanded_conv_project_BN/FusedBatchNormV3:0 0=16 1=1 5=1 6=512
Convolution              functional_1/block_1_expand/Conv2D 1 1 functional_1/expanded_conv_project_BN/FusedBatchNormV3:0 functional_1/block_1_expand_relu/Relu6:0 0=96 1=1 5=1 6=1536 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     functional_1/block_1_depthwise/depthwise 1 1 functional_1/block_1_expand_relu/Relu6:0 functional_1/block_1_depthwise_relu/Relu6:0 0=96 1=3 3=2 15=1 16=1 5=1 6=864 7=96 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              functional_1/block_1_project/Conv2D 1 1 functional_1/block_1_depthwise_relu/Relu6:0 functional_1/block_1_project_BN/FusedBatchNormV3:0 0=24 1=1 5=1 6=2304
Split                    splitncnn_0              1 2 functional_1/block_1_project_BN/FusedBatchNormV3:0 functional_1/block_1_project_BN/FusedBatchNormV3:0_splitncnn_0 functional_1/block_1_project_BN/FusedBatchNormV3:0_splitncnn_1
Convolution              functional_1/block_2_expand/Conv2D 1 1 functional_1/block_1_project_BN/FusedBatchNormV3:0_splitncnn_1 functional_1/block_2_expand_relu/Relu6:0 0=144 1=1 5=1 6=3456 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     functional_1/block_2_depthwise/depthwise 1 1 functional_1/block_2_expand_relu/Relu6:0 functional_1/block_2_depthwise_relu/Relu6:0 0=144 1=3 4=1 5=1 6=1296 7=144 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              functional_1/block_2_project/Conv2D 1 1 functional_1/block_2_depthwise_relu/Relu6:0 functional_1/block_2_project_BN/FusedBatchNormV3:0 0=24 1=1 5=1 6=3456
BinaryOp                 functional_1/block_2_add/add 2 1 functional_1/block_1_project_BN/FusedBatchNormV3:0_splitncnn_0 functional_1/block_2_project_BN/FusedBatchNormV3:0 functional_1/block_2_add/add:0
Convolution              functional_1/block_3_expand/Conv2D 1 1 functional_1/block_2_add/add:0 functional_1/block_3_expand_relu/Relu6:0 0=144 1=1 5=1 6=3456 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     functional_1/block_3_depthwise/depthwise 1 1 functional_1/block_3_expand_relu/Relu6:0 functional_1/block_3_depthwise_relu/Relu6:0 0=144 1=3 3=2 15=1 16=1 5=1 6=1296 7=144 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              functional_1/block_3_project/Conv2D 1 1 functional_1/block_3_depthwise_relu/Relu6:0 functional_1/block_3_project_BN/FusedBatchNormV3:0 0=32 1=1 5=1 6=4608
Split                    splitncnn_1              1 2 functional_1/block_3_project_BN/FusedBatchNormV3:0 functional_1/block_3_project_BN/FusedBatchNormV3:0_splitncnn_0 functional_1/block_3_project_BN/FusedBatchNormV3:0_splitncnn_1
Convolution              functional_1/block_4_expand/Conv2D 1 1 functional_1/block_3_project_BN/FusedBatchNormV3:0_splitncnn_1 functional_1/block_4_expand_relu/Relu6:0 0=192 1=1 5=1 6=6144 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     functional_1/block_4_depthwise/depthwise 1 1 functional_1/block_4_expand_relu/Relu6:0 functional_1/block_4_depthwise_relu/Relu6:0 0=192 1=3 4=1 5=1 6=1728 7=192 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              functional_1/block_4_project/Conv2D 1 1 functional_1/block_4_depthwise_relu/Relu6:0 functional_1/block_4_project_BN/FusedBatchNormV3:0 0=32 1=1 5=1 6=6144
BinaryOp                 functional_1/block_4_add/add 2 1 functional_1/block_3_project_BN/FusedBatchNormV3:0_splitncnn_0 functional_1/block_4_project_BN/FusedBatchNormV3:0 functional_1/block_4_add/add:0
Split                    splitncnn_2              1 2 functional_1/block_4_add/add:0 functional_1/block_4_add/add:0_splitncnn_0 functional_1/block_4_add/add:0_splitncnn_1
Convolution              functional_1/block_5_expand/Conv2D 1 1 functional_1/block_4_add/add:0_splitncnn_1 functional_1/block_5_expand_relu/Relu6:0 0=192 1=1 5=1 6=6144 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     functional_1/block_5_depthwise/depthwise 1 1 functional_1/block_5_expand_relu/Relu6:0 functional_1/block_5_depthwise_relu/Relu6:0 0=192 1=3 4=1 5=1 6=1728 7=192 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              functional_1/block_5_project/Conv2D 1 1 functional_1/block_5_depthwise_relu/Relu6:0 functional_1/block_5_project_BN/FusedBatchNormV3:0 0=32 1=1 5=1 6=6144
BinaryOp                 functional_1/block_5_add/add 2 1 functional_1/block_4_add/add:0_splitncnn_0 functional_1/block_5_project_BN/FusedBatchNormV3:0 functional_1/block_5_add/add:0
Convolution              functional_1/block_6_expand/Conv2D 1 1 functional_1/block_5_add/add:0 functional_1/block_6_expand_relu/Relu6:0 0=192 1=1 5=1 6=6144 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     functional_1/block_6_depthwise/depthwise 1 1 functional_1/block_6_expand_relu/Relu6:0 functional_1/block_6_depthwise_relu/Relu6:0 0=192 1=3 3=2 15=1 16=1 5=1 6=1728 7=192 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              functional_1/block_6_project/Conv2D 1 1 functional_1/block_6_depthwise_relu/Relu6:0 functional_1/block_6_project_BN/FusedBatchNormV3:0 0=64 1=1 5=1 6=12288
Split                    splitncnn_3              1 2 functional_1/block_6_project_BN/FusedBatchNormV3:0 functional_1/block_6_project_BN/FusedBatchNormV3:0_splitncnn_0 functional_1/block_6_project_BN/FusedBatchNormV3:0_splitncnn_1
Convolution              functional_1/block_7_expand/Conv2D 1 1 functional_1/block_6_project_BN/FusedBatchNormV3:0_splitncnn_1 functional_1/block_7_expand_relu/Relu6:0 0=384 1=1 5=1 6=24576 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     functional_1/block_7_depthwise/depthwise 1 1 functional_1/block_7_expand_relu/Relu6:0 functional_1/block_7_depthwise_relu/Relu6:0 0=384 1=3 4=1 5=1 6=3456 7=384 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              functional_1/block_7_project/Conv2D 1 1 functional_1/block_7_depthwise_relu/Relu6:0 functional_1/block_7_project_BN/FusedBatchNormV3:0 0=64 1=1 5=1 6=24576
BinaryOp                 functional_1/block_7_add/add 2 1 functional_1/block_6_project_BN/FusedBatchNormV3:0_splitncnn_0 functional_1/block_7_project_BN/FusedBatchNormV3:0 functional_1/block_7_add/add:0
Split                    splitncnn_4              1 2 functional_1/block_7_add/add:0 functional_1/block_7_add/add:0_splitncnn_0 functional_1/block_7_add/add:0_splitncnn_1
Convolution              functional_1/block_8_expand/Conv2D 1 1 functional_1/block_7_add/add:0_splitncnn_1 functional_1/block_8_expand_relu/Relu6:0 0=384 1=1 5=1 6=24576 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     functional_1/block_8_depthwise/depthwise 1 1 functional_1/block_8_expand_relu/Relu6:0 functional_1/block_8_depthwise_relu/Relu6:0 0=384 1=3 4=1 5=1 6=3456 7=384 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              functional_1/block_8_project/Conv2D 1 1 functional_1/block_8_depthwise_relu/Relu6:0 functional_1/block_8_project_BN/FusedBatchNormV3:0 0=64 1=1 5=1 6=24576
BinaryOp                 functional_1/block_8_add/add 2 1 functional_1/block_7_add/add:0_splitncnn_0 functional_1/block_8_project_BN/FusedBatchNormV3:0 functional_1/block_8_add/add:0
Split                    splitncnn_5              1 2 functional_1/block_8_add/add:0 functional_1/block_8_add/add:0_splitncnn_0 functional_1/block_8_add/add:0_splitncnn_1
Convolution              functional_1/block_9_expand/Conv2D 1 1 functional_1/block_8_add/add:0_splitncnn_1 functional_1/block_9_expand_relu/Relu6:0 0=384 1=1 5=1 6=24576 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     functional_1/block_9_depthwise/depthwise 1 1 functional_1/block_9_expand_relu/Relu6:0 functional_1/block_9_depthwise_relu/Relu6:0 0=384 1=3 4=1 5=1 6=3456 7=384 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              functional_1/block_9_project/Conv2D 1 1 functional_1/block_9_depthwise_relu/Relu6:0 functional_1/block_9_project_BN/FusedBatchNormV3:0 0=64 1=1 5=1 6=24576
BinaryOp                 functional_1/block_9_add/add 2 1 functional_1/block_8_add/add:0_splitncnn_0 functional_1/block_9_project_BN/FusedBatchNormV3:0 functional_1/block_9_add/add:0
Convolution              functional_1/block_10_expand/Conv2D 1 1 functional_1/block_9_add/add:0 functional_1/block_10_expand_relu/Relu6:0 0=384 1=1 5=1 6=24576 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     functional_1/block_10_depthwise/depthwise 1 1 functional_1/block_10_expand_relu/Relu6:0 functional_1/block_10_depthwise_relu/Relu6:0 0=384 1=3 4=1 5=1 6=3456 7=384 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              functional_1/block_10_project/Conv2D 1 1 functional_1/block_10_depthwise_relu/Relu6:0 functional_1/block_10_project_BN/FusedBatchNormV3:0 0=96 1=1 5=1 6=36864
Split                    splitncnn_6              1 2 functional_1/block_10_project_BN/FusedBatchNormV3:0 functional_1/block_10_project_BN/FusedBatchNormV3:0_splitncnn_0 functional_1/block_10_project_BN/FusedBatchNormV3:0_splitncnn_1
Convolution              functional_1/block_11_expand/Conv2D 1 1 functional_1/block_10_project_BN/FusedBatchNormV3:0_splitncnn_1 functional_1/block_11_expand_relu/Relu6:0 0=576 1=1 5=1 6=55296 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     functional_1/block_11_depthwise/depthwise 1 1 functional_1/block_11_expand_relu/Relu6:0 functional_1/block_11_depthwise_relu/Relu6:0 0=576 1=3 4=1 5=1 6=5184 7=576 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              functional_1/block_11_project/Conv2D 1 1 functional_1/block_11_depthwise_relu/Relu6:0 functional_1/block_11_project_BN/FusedBatchNormV3:0 0=96 1=1 5=1 6=55296
BinaryOp                 functional_1/block_11_add/add 2 1 functional_1/block_10_project_BN/FusedBatchNormV3:0_splitncnn_0 functional_1/block_11_project_BN/FusedBatchNormV3:0 functional_1/block_11_add/add:0
Split                    splitncnn_7              1 2 functional_1/block_11_add/add:0 functional_1/block_11_add/add:0_splitncnn_0 functional_1/block_11_add/add:0_splitncnn_1
Convolution              functional_1/block_12_expand/Conv2D 1 1 functional_1/block_11_add/add:0_splitncnn_1 functional_1/block_12_expand_relu/Relu6:0 0=576 1=1 5=1 6=55296 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     functional_1/block_12_depthwise/depthwise 1 1 functional_1/block_12_expand_relu/Relu6:0 functional_1/block_12_depthwise_relu/Relu6:0 0=576 1=3 4=1 5=1 6=5184 7=576 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              functional_1/block_12_project/Conv2D 1 1 functional_1/block_12_depthwise_relu/Relu6:0 functional_1/block_12_project_BN/FusedBatchNormV3:0 0=96 1=1 5=1 6=55296
BinaryOp                 functional_1/block_12_add/add 2 1 functional_1/block_11_add/add:0_splitncnn_0 functional_1/block_12_project_BN/FusedBatchNormV3:0 functional_1/block_12_add/add:0
BatchNorm                functional_1/batch_normalization/FusedBatchNormV3 1 1 functional_1/block_12_add/add:0 functional_1/batch_normalization/FusedBatchNormV3:0 0=96
Split                    splitncnn_8              1 3 functional_1/batch_normalization/FusedBatchNormV3:0 functional_1/batch_normalization/FusedBatchNormV3:0_splitncnn_0 functional_1/batch_normalization/FusedBatchNormV3:0_splitncnn_1 functional_1/batch_normalization/FusedBatchNormV3:0_splitncnn_2
Convolution              functional_1/conv2d_6/BiasAdd 1 1 functional_1/batch_normalization/FusedBatchNormV3:0_splitncnn_2 functional_1/conv2d_6/Relu:0 0=64 1=3 3=2 15=1 16=1 5=1 6=55296 9=1
BatchNorm                functional_1/batch_normalization_6/FusedBatchNormV3 1 1 functional_1/conv2d_6/Relu:0 functional_1/batch_normalization_6/FusedBatchNormV3:0 0=64
Convolution              functional_1/conv2d_7/BiasAdd 1 1 functional_1/batch_normalization_6/FusedBatchNormV3:0 functional_1/conv2d_7/Relu:0 0=128 1=3 3=2 15=1 16=1 5=1 6=73728 9=1
BatchNorm                functional_1/batch_normalization_7/FusedBatchNormV3 1 1 functional_1/conv2d_7/Relu:0 functional_1/batch_normalization_7/FusedBatchNormV3:0 0=128
Convolution              functional_1/conv2d_8/BiasAdd 1 1 functional_1/batch_normalization_7/FusedBatchNormV3:0 functional_1/conv2d_8/Relu:0 0=256 1=4 5=1 6=524288 9=1
BatchNorm                functional_1/batch_normalization_8/FusedBatchNormV3 1 1 functional_1/conv2d_8/Relu:0 functional_1/batch_normalization_8/FusedBatchNormV3:0 0=256
Convolution              functional_1/conv2d_9/BiasAdd 1 1 functional_1/batch_normalization_8/FusedBatchNormV3:0 functional_1/conv2d_9/Relu:0 0=256 1=1 5=1 6=65536 9=1
BatchNorm                functional_1/batch_normalization_9/FusedBatchNormV3 1 1 functional_1/conv2d_9/Relu:0 functional_1/batch_normalization_9/FusedBatchNormV3:0 0=256
Convolution              functional_1/conv2d_10/BiasAdd 1 1 functional_1/batch_normalization_9/FusedBatchNormV3:0 functional_1/conv2d_10/Relu:0 0=128 1=1 5=1 6=32768 9=1
BatchNorm                functional_1/batch_normalization_10/FusedBatchNormV3 1 1 functional_1/conv2d_10/Relu:0 functional_1/batch_normalization_10/FusedBatchNormV3:0 0=128
Convolution              functional_1/conv2d_11/BiasAdd 1 1 functional_1/batch_normalization_10/FusedBatchNormV3:0 functional_1/conv2d_11/BiasAdd:0 0=2 1=1 5=1 6=256
Convolution              functional_1/conv2d_12/BiasAdd 1 1 functional_1/batch_normalization/FusedBatchNormV3:0_splitncnn_1 functional_1/conv2d_12/Relu:0 0=64 1=3 3=2 15=1 16=1 5=1 6=55296 9=1
BatchNorm                functional_1/batch_normalization_11/FusedBatchNormV3 1 1 functional_1/conv2d_12/Relu:0 functional_1/batch_normalization_11/FusedBatchNormV3:0 0=64
Convolution              functional_1/conv2d_13/BiasAdd 1 1 functional_1/batch_normalization_11/FusedBatchNormV3:0 functional_1/conv2d_13/Relu:0 0=128 1=3 3=2 15=1 16=1 5=1 6=73728 9=1
BatchNorm                functional_1/batch_normalization_12/FusedBatchNormV3 1 1 functional_1/conv2d_13/Relu:0 functional_1/batch_normalization_12/FusedBatchNormV3:0 0=128
Convolution              functional_1/conv2d_14/BiasAdd 1 1 functional_1/batch_normalization_12/FusedBatchNormV3:0 functional_1/conv2d_14/Relu:0 0=256 1=4 5=1 6=524288 9=1
BatchNorm                functional_1/batch_normalization_13/FusedBatchNormV3 1 1 functional_1/conv2d_14/Relu:0 functional_1/batch_normalization_13/FusedBatchNormV3:0 0=256
Convolution              functional_1/conv2d_15/BiasAdd 1 1 functional_1/batch_normalization_13/FusedBatchNormV3:0 functional_1/conv2d_15/Relu:0 0=256 1=1 5=1 6=65536 9=1
BatchNorm                functional_1/batch_normalization_14/FusedBatchNormV3 1 1 functional_1/conv2d_15/Relu:0 functional_1/batch_normalization_14/FusedBatchNormV3:0 0=256
Convolution              functional_1/conv2d_16/BiasAdd 1 1 functional_1/batch_normalization_14/FusedBatchNormV3:0 functional_1/conv2d_16/Relu:0 0=128 1=1 5=1 6=32768 9=1
BatchNorm                functional_1/batch_normalization_15/FusedBatchNormV3 1 1 functional_1/conv2d_16/Relu:0 functional_1/batch_normalization_15/FusedBatchNormV3:0 0=128
Convolution              functional_1/conv2d_17/BiasAdd 1 1 functional_1/batch_normalization_15/FusedBatchNormV3:0 functional_1/conv2d_17/BiasAdd:0 0=1 1=1 5=1 6=128
Convolution              functional_1/conv2d/Conv2D 1 1 functional_1/batch_normalization/FusedBatchNormV3:0_splitncnn_0 functional_1/conv2d/Relu:0 0=64 1=3 3=2 15=1 16=1 6=55296 9=1
BatchNorm                functional_1/batch_normalization_1/FusedBatchNormV3 1 1 functional_1/conv2d/Relu:0 functional_1/batch_normalization_1/FusedBatchNormV3:0 0=64
Convolution              functional_1/conv2d_1/Conv2D 1 1 functional_1/batch_normalization_1/FusedBatchNormV3:0 functional_1/conv2d_1/Relu:0 0=128 1=3 3=2 15=1 16=1 6=73728 9=1
BatchNorm                functional_1/batch_normalization_2/FusedBatchNormV3 1 1 functional_1/conv2d_1/Relu:0 functional_1/batch_normalization_2/FusedBatchNormV3:0 0=128
Convolution              functional_1/conv2d_2/Conv2D 1 1 functional_1/batch_normalization_2/FusedBatchNormV3:0 functional_1/conv2d_2/Relu:0 0=256 1=4 6=524288 9=1
BatchNorm                functional_1/batch_normalization_3/FusedBatchNormV3 1 1 functional_1/conv2d_2/Relu:0 functional_1/batch_normalization_3/FusedBatchNormV3:0 0=256
Convolution              functional_1/conv2d_3/Conv2D 1 1 functional_1/batch_normalization_3/FusedBatchNormV3:0 functional_1/conv2d_3/Relu:0 0=256 1=1 6=65536 9=1
BatchNorm                functional_1/batch_normalization_4/FusedBatchNormV3 1 1 functional_1/conv2d_3/Relu:0 functional_1/batch_normalization_4/FusedBatchNormV3:0 0=256
Convolution              functional_1/conv2d_4/Conv2D 1 1 functional_1/batch_normalization_4/FusedBatchNormV3:0 functional_1/conv2d_4/Relu:0 0=128 1=1 6=32768 9=1
BatchNorm                functional_1/batch_normalization_5/FusedBatchNormV3 1 1 functional_1/conv2d_4/Relu:0 functional_1/batch_normalization_5/FusedBatchNormV3:0 0=128
Convolution              functional_1/conv2d_5/Conv2D 1 1 functional_1/batch_normalization_5/FusedBatchNormV3:0 functional_1/conv2d_5/Conv2D:0 0=2 1=1 6=256
Reshape                  functional_1/flatten_2/Reshape 1 1 functional_1/conv2d_17/BiasAdd:0 functional_1/flatten_2/Reshape:0 0=1
Reshape                  functional_1/flatten_1/Reshape 1 1 functional_1/conv2d_11/BiasAdd:0 functional_1/flatten_1/Reshape:0 0=2
Reshape                  functional_1/flatten/Reshape 1 1 functional_1/conv2d_5/Conv2D:0 functional_1/flatten/Reshape:0 0=2
Concat                   functional_1/concatenate/concat 3 1 functional_1/flatten/Reshape:0 functional_1/flatten_1/Reshape:0 functional_1/flatten_2/Reshape:0 concatenate
